The terraform plan `tf.plan` has been uploaded as a Github artifact in [this job](https://github.com/maelvls/gh-actions-chatops/actions/runs/99266200). Here is the plan:

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_storage_bucket_object.index_html must be replaced
-/+ resource "google_storage_bucket_object" "index_html" {
        bucket         = "my-static-site"
      ~ content        = (sensitive value)
      ~ content_type   = "text/plain; charset=utf-8" -> (known after apply)
      ~ crc32c         = "1hHPaA==" -> (known after apply)
      ~ detect_md5hash = "jT+tsogMGXusvcrHE+3lGg==" -> "different hash"
      ~ id             = "my-static-site-index.html" -> (known after apply)
      ~ md5hash        = "jT+tsogMGXusvcrHE+3lGg==" -> (known after apply)
        name           = "index.html"
      ~ output_name    = "index.html" -> (known after apply)
      ~ self_link      = "https://www.googleapis.com/storage/v1/b/my-static-site/o/index.html" -> (known after apply)
      ~ storage_class  = "STANDARD" -> (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

As soon as the PR is approved, anyone can run `/apply`. The `/apply` command will apply the last plan shown in this PR using the `tf.plan` that was [uploaded as a Github artifact](https://github.com/maelvls/gh-actions-chatops/actions/runs/99266200). The output of `terraform apply` will be shown in a PR comment.
